{
    "vocab_size": 152064,
    "max_position_embeddings": 32768,
    "hidden_size": 3584,
    "intermediate_size": 18944,
    "num_hidden_layers": 28,
    "num_attention_heads": 28,
    "use_sliding_window": false,
    "sliding_window": null,
    "max_window_layers": 28,
    "num_key_value_heads": 4,
    "hidden_act": "silu",
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-06,
    "use_cache": true,
    "rope_theta": 1000000.0,
    "rope_scaling": null,
    "attention_dropout": 0.0,
    "layer_types": [
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention"
    ],
    "dtype": "bfloat16",
    "tie_word_embeddings": false,
    "architectures": [
        "Qwen2ForCausalLM"
    ],
    "bos_token_id": 151643,
    "eos_token_id": 151643,
    "transformers_version": "4.56.2",
    "model_type": "qwen2"
}