{
    "task_type": "CAUSAL_LM",
    "peft_type": "PROMPT_TUNING",
    "auto_mapping": null,
    "base_model_name_or_path": "Salesforce/codegen-350M-multi",
    "revision": null,
    "inference_mode": true,
    "num_virtual_tokens": 20,
    "token_dim": 1024,
    "num_transformer_submodules": 1,
    "num_attention_heads": 16,
    "num_layers": 20,
    "prompt_tuning_init": "RANDOM",
    "prompt_tuning_init_text": null,
    "tokenizer_name_or_path": "Salesforce/codegen-350M-multi",
    "tokenizer_kwargs": null
}