{
    "peft_type": "PROMPT_TUNING",
    "auto_mapping": null,
    "base_model_name_or_path": "Salesforce/codegen2-16B_P",
    "revision": null,
    "task_type": "CAUSAL_LM",
    "inference_mode": true,
    "num_virtual_tokens": 20,
    "token_dim": 6144,
    "num_transformer_submodules": 1,
    "num_attention_heads": 24,
    "num_layers": 34,
    "prompt_tuning_init": "RANDOM",
    "prompt_tuning_init_text": null,
    "tokenizer_name_or_path": "Salesforce/codegen2-16B_P",
    "tokenizer_kwargs": null
}