{
    "vocab_size": 152064,
    "max_position_embeddings": 32768,
    "hidden_size": 5120,
    "intermediate_size": 13824,
    "num_hidden_layers": 48,
    "num_attention_heads": 40,
    "use_sliding_window": false,
    "sliding_window": null,
    "max_window_layers": 48,
    "num_key_value_heads": 8,
    "hidden_act": "silu",
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-06,
    "use_cache": true,
    "rope_theta": 1000000.0,
    "rope_scaling": null,
    "attention_dropout": 0.0,
    "layer_types": [
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention"
    ],
    "return_dict": true,
    "output_hidden_states": false,
    "torchscript": false,
    "dtype": "bfloat16",
    "pruned_heads": {},
    "tie_word_embeddings": false,
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "is_decoder": false,
    "cross_attention_hidden_size": null,
    "add_cross_attention": false,
    "tie_encoder_decoder": false,
    "architectures": [
        "Qwen2ForCausalLM"
    ],
    "finetuning_task": null,
    "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
    },
    "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
    },
    "task_specific_params": null,
    "problem_type": null,
    "tokenizer_class": null,
    "prefix": null,
    "bos_token_id": 151643,
    "pad_token_id": null,
    "eos_token_id": 151643,
    "sep_token_id": null,
    "decoder_start_token_id": null,
    "max_length": 20,
    "min_length": 0,
    "do_sample": false,
    "early_stopping": false,
    "num_beams": 1,
    "num_beam_groups": 1,
    "diversity_penalty": 0.0,
    "temperature": 1.0,
    "top_k": 50,
    "top_p": 1.0,
    "typical_p": 1.0,
    "repetition_penalty": 1.0,
    "length_penalty": 1.0,
    "no_repeat_ngram_size": 0,
    "encoder_no_repeat_ngram_size": 0,
    "bad_words_ids": null,
    "num_return_sequences": 1,
    "output_scores": false,
    "return_dict_in_generate": false,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "remove_invalid_values": false,
    "exponential_decay_length_penalty": null,
    "suppress_tokens": null,
    "begin_suppress_tokens": null,
    "_name_or_path": "Qwen/Qwen2.5-Coder-14B",
    "transformers_version": "4.56.2",
    "model_type": "qwen2",
    "tf_legacy_loss": false,
    "use_bfloat16": false,
    "output_attentions": false
}