{
    "vocab_size": 49152,
    "max_position_embeddings": 16384,
    "hidden_size": 4608,
    "intermediate_size": 18432,
    "num_hidden_layers": 32,
    "num_attention_heads": 36,
    "sliding_window": 4096,
    "use_bias": true,
    "num_key_value_heads": 4,
    "hidden_act": "gelu_pytorch_tanh",
    "initializer_range": 0.018042,
    "norm_epsilon": 1e-05,
    "use_cache": true,
    "rope_theta": 1000000,
    "attention_dropout": 0.1,
    "residual_dropout": 0.1,
    "embedding_dropout": 0.1,
    "torch_dtype": "bfloat16",
    "architectures": [
        "Starcoder2ForCausalLM"
    ],
    "bos_token_id": 0,
    "eos_token_id": 0,
    "_name_or_path": "../language-modeling/experiments/fine_tuning/10/output/",
    "transformers_version": "4.40.1",
    "activation_function": "gelu",
    "attention_softmax_in_fp32": true,
    "layer_norm_epsilon": 1e-05,
    "mlp_type": "default",
    "model_type": "starcoder2",
    "norm_type": "layer_norm",
    "scale_attention_softmax_in_fp32": true,
    "scale_attn_weights": true
}