{
    "task_type": "CAUSAL_LM",
    "peft_type": "PROMPT_TUNING",
    "auto_mapping": null,
    "base_model_name_or_path": "Qwen/Qwen2.5-Coder-14B",
    "revision": null,
    "inference_mode": true,
    "num_virtual_tokens": 20,
    "token_dim": 5120,
    "num_transformer_submodules": 1,
    "num_attention_heads": 40,
    "num_layers": 48,
    "prompt_tuning_init": "RANDOM",
    "prompt_tuning_init_text": null,
    "tokenizer_name_or_path": "Qwen/Qwen2.5-Coder-14B",
    "tokenizer_kwargs": null
}