{
    "vocab_size": 49152,
    "n_positions": 8192,
    "n_embd": 6144,
    "n_layer": 40,
    "n_head": 48,
    "n_inner": 24576,
    "activation_function": "gelu",
    "resid_pdrop": 0.1,
    "embd_pdrop": 0.1,
    "attn_pdrop": 0.1,
    "layer_norm_epsilon": 1e-05,
    "initializer_range": 0.02,
    "scale_attn_weights": true,
    "use_cache": true,
    "attention_softmax_in_fp32": true,
    "scale_attention_softmax_in_fp32": true,
    "multi_query": true,
    "bos_token_id": 0,
    "eos_token_id": 0,
    "torch_dtype": "bfloat16",
    "architectures": [
        "GPTBigCodeForCausalLM"
    ],
    "_name_or_path": "../language-modeling/experiments/fine_tuning/8/output/",
    "transformers_version": "4.41.0",
    "inference_runner": 0,
    "max_batch_size": null,
    "max_sequence_length": null,
    "model_type": "gpt_bigcode",
    "pad_key_length": true,
    "pre_allocate_kv_cache": false,
    "summary_activation": null,
    "summary_first_dropout": 0.1,
    "summary_proj_to_labels": true,
    "summary_type": "cls_index",
    "summary_use_proj": true,
    "validate_runner_input": true
}