{
    "vocab_size": 49152,
    "max_position_embeddings": 16384,
    "hidden_size": 3072,
    "intermediate_size": 12288,
    "num_hidden_layers": 30,
    "num_attention_heads": 24,
    "sliding_window": 4096,
    "use_bias": true,
    "num_key_value_heads": 2,
    "hidden_act": "gelu_pytorch_tanh",
    "initializer_range": 0.018042,
    "norm_epsilon": 1e-05,
    "use_cache": true,
    "rope_theta": 999999.4420358813,
    "attention_dropout": 0.1,
    "residual_dropout": 0.1,
    "embedding_dropout": 0.1,
    "architectures": [
        "Starcoder2ForCausalLM"
    ],
    "bos_token_id": 0,
    "eos_token_id": 0,
    "_name_or_path": "bigcode/starcoder2-3b",
    "transformers_version": "4.40.1",
    "mlp_type": "default",
    "model_type": "starcoder2",
    "norm_type": "layer_norm"
}