{
    "vocab_size": 32016,
    "max_position_embeddings": 16384,
    "hidden_size": 4096,
    "intermediate_size": 11008,
    "num_hidden_layers": 32,
    "num_attention_heads": 32,
    "num_key_value_heads": 32,
    "hidden_act": "silu",
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-05,
    "pretraining_tp": 1,
    "use_cache": true,
    "rope_theta": 1000000,
    "rope_scaling": null,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "torch_dtype": "bfloat16",
    "tie_word_embeddings": false,
    "architectures": [
        "LlamaForCausalLM"
    ],
    "bos_token_id": 1,
    "eos_token_id": 2,
    "_name_or_path": "../language-modeling/experiments/fine_tuning/7/output/",
    "transformers_version": "4.40.1",
    "model_type": "llama"
}