{
    "transformers_version": "5.5.3",
    "architectures": [
        "Starcoder2ForCausalLM"
    ],
    "dtype": "bfloat16",
    "vocab_size": 49152,
    "hidden_size": 6144,
    "intermediate_size": 24576,
    "num_hidden_layers": 40,
    "num_attention_heads": 48,
    "num_key_value_heads": 4,
    "hidden_act": "gelu_pytorch_tanh",
    "max_position_embeddings": 16384,
    "initializer_range": 0.01275,
    "norm_epsilon": 1e-05,
    "use_cache": true,
    "bos_token_id": 0,
    "eos_token_id": 0,
    "pad_token_id": null,
    "rope_parameters": {
        "rope_theta": 100000,
        "rope_type": "default"
    },
    "sliding_window": 4096,
    "attention_dropout": 0.1,
    "residual_dropout": 0.1,
    "embedding_dropout": 0.1,
    "use_bias": true,
    "tie_word_embeddings": false,
    "mlp_type": "default",
    "model_type": "starcoder2",
    "norm_type": "layer_norm"
}