{
    "transformers_version": "5.5.3",
    "architectures": [
        "GPTBigCodeForCausalLM"
    ],
    "output_hidden_states": false,
    "return_dict": true,
    "dtype": "bfloat16",
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
    },
    "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
    },
    "problem_type": null,
    "vocab_size": 49152,
    "n_positions": 8192,
    "n_embd": 6144,
    "n_layer": 40,
    "n_head": 48,
    "n_inner": 24576,
    "activation_function": "gelu",
    "resid_pdrop": 0.1,
    "embd_pdrop": 0.1,
    "attn_pdrop": 0.1,
    "layer_norm_epsilon": 1e-05,
    "initializer_range": 0.02,
    "scale_attn_weights": true,
    "use_cache": true,
    "bos_token_id": 0,
    "eos_token_id": 0,
    "pad_token_id": null,
    "attention_softmax_in_fp32": true,
    "scale_attention_softmax_in_fp32": true,
    "multi_query": true,
    "add_cross_attention": false,
    "tie_word_embeddings": true,
    "num_key_value_heads": 1,
    "_name_or_path": "andstor/bigcode-starcoderbase-unit-test-fine-tuning",
    "inference_runner": 0,
    "max_batch_size": null,
    "max_sequence_length": null,
    "model_type": "gpt_bigcode",
    "pad_key_length": true,
    "pre_allocate_kv_cache": false,
    "summary_activation": null,
    "summary_first_dropout": 0.1,
    "summary_proj_to_labels": true,
    "summary_type": "cls_index",
    "summary_use_proj": true,
    "validate_runner_input": true,
    "output_attentions": false
}