{
    "transformers_version": "5.5.3",
    "architectures": [
        "Qwen2ForCausalLM"
    ],
    "output_hidden_states": false,
    "return_dict": true,
    "dtype": "bfloat16",
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
    },
    "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
    },
    "problem_type": null,
    "vocab_size": 152064,
    "hidden_size": 5120,
    "intermediate_size": 13824,
    "num_hidden_layers": 48,
    "num_attention_heads": 40,
    "num_key_value_heads": 8,
    "hidden_act": "silu",
    "max_position_embeddings": 32768,
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-06,
    "use_cache": true,
    "tie_word_embeddings": false,
    "rope_parameters": {
        "rope_theta": 1000000.0,
        "rope_type": "default"
    },
    "use_sliding_window": false,
    "sliding_window": null,
    "max_window_layers": 48,
    "layer_types": [
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention"
    ],
    "attention_dropout": 0.0,
    "pad_token_id": null,
    "bos_token_id": 151643,
    "eos_token_id": 151643,
    "_name_or_path": "Qwen/Qwen2.5-Coder-14B",
    "model_type": "qwen2",
    "output_attentions": false
}