{
    "transformers_version": "5.5.3",
    "architectures": [
        "Starcoder2ForCausalLM"
    ],
    "output_hidden_states": false,
    "return_dict": true,
    "dtype": "bfloat16",
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
    },
    "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
    },
    "problem_type": null,
    "vocab_size": 49152,
    "hidden_size": 4608,
    "intermediate_size": 18432,
    "num_hidden_layers": 32,
    "num_attention_heads": 36,
    "num_key_value_heads": 4,
    "hidden_act": "gelu_pytorch_tanh",
    "max_position_embeddings": 16384,
    "initializer_range": 0.018042,
    "norm_epsilon": 1e-05,
    "use_cache": true,
    "bos_token_id": 0,
    "eos_token_id": 0,
    "pad_token_id": null,
    "rope_parameters": {
        "rope_theta": 1000000,
        "rope_type": "default"
    },
    "sliding_window": 4096,
    "attention_dropout": 0.1,
    "residual_dropout": 0.1,
    "embedding_dropout": 0.1,
    "use_bias": true,
    "tie_word_embeddings": true,
    "_name_or_path": "andstor/bigcode-starcoder2-7b-unit-test-fine-tuning",
    "activation_function": "gelu",
    "attention_softmax_in_fp32": true,
    "layer_norm_epsilon": 1e-05,
    "mlp_type": "default",
    "model_type": "starcoder2",
    "norm_type": "layer_norm",
    "scale_attention_softmax_in_fp32": true,
    "scale_attn_weights": true,
    "output_attentions": false
}