{
    "transformers_version": "5.5.3",
    "architectures": [
        "LlamaForCausalLM"
    ],
    "output_hidden_states": false,
    "return_dict": true,
    "dtype": "bfloat16",
    "chunk_size_feed_forward": 0,
    "is_encoder_decoder": false,
    "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
    },
    "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
    },
    "problem_type": null,
    "vocab_size": 32016,
    "hidden_size": 4096,
    "intermediate_size": 11008,
    "num_hidden_layers": 32,
    "num_attention_heads": 32,
    "num_key_value_heads": 32,
    "hidden_act": "silu",
    "max_position_embeddings": 16384,
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-05,
    "use_cache": true,
    "pad_token_id": null,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "pretraining_tp": 1,
    "tie_word_embeddings": false,
    "rope_parameters": {
        "rope_theta": 1000000,
        "rope_type": "default"
    },
    "attention_bias": false,
    "attention_dropout": 0.0,
    "mlp_bias": false,
    "head_dim": 128,
    "_name_or_path": "andstor/meta-llama-CodeLlama-7b-hf-unit-test-fine-tuning",
    "model_type": "llama",
    "output_attentions": false
}