{
    "vocab_size": 51200,
    "n_ctx": 2048,
    "n_positions": 2048,
    "n_embd": 4096,
    "n_layer": 32,
    "n_head": 16,
    "n_inner": null,
    "rotary_dim": 64,
    "activation_function": "gelu_new",
    "resid_pdrop": 0.0,
    "embd_pdrop": 0.0,
    "attn_pdrop": 0.0,
    "layer_norm_epsilon": 1e-05,
    "initializer_range": 0.02,
    "use_cache": true,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "torch_dtype": "float16",
    "tie_word_embeddings": false,
    "architectures": [
        "CodeGenForCausalLM"
    ],
    "tokenizer_class": "GPT2Tokenizer",
    "task_specific_params": {
        "text-generation": {
            "do_sample": true,
            "max_length": 50,
            "temperature": 1.0
        }
    },
    "_name_or_path": "../language-modeling/experiments/fine_tuning/4/output/",
    "transformers_version": "4.41.0",
    "auto_map": {
        "AutoConfig": "Salesforce/codegen2-7B_P--configuration_codegen.CodeGenConfig",
        "AutoModel": "Salesforce/codegen2-7B_P--modeling_codegen.CodeGenModel",
        "AutoModelForCausalLM": "Salesforce/codegen2-7B_P--modeling_codegen.CodeGenForCausalLM"
    },
    "gradient_checkpointing": false,
    "model_type": "codegen",
    "scale_attn_weights": true,
    "summary_activation": null,
    "summary_first_dropout": 0.1,
    "summary_proj_to_labels": true,
    "summary_type": "cls_index",
    "summary_use_proj": true
}