{
    "vocab_size": 49152,
    "max_position_embeddings": 16384,
    "hidden_size": 6144,
    "intermediate_size": 24576,
    "num_hidden_layers": 40,
    "num_attention_heads": 48,
    "sliding_window": 4096,
    "use_bias": true,
    "num_key_value_heads": 4,
    "hidden_act": "gelu_pytorch_tanh",
    "initializer_range": 0.01275,
    "norm_epsilon": 1e-05,
    "use_cache": true,
    "rope_theta": 100000,
    "attention_dropout": 0.1,
    "residual_dropout": 0.1,
    "embedding_dropout": 0.1,
    "torch_dtype": "float32",
    "tie_word_embeddings": false,
    "architectures": [
        "Starcoder2ForCausalLM"
    ],
    "bos_token_id": 0,
    "eos_token_id": 0,
    "_name_or_path": "bigcode/starcoder2-15b",
    "transformers_version": "4.41.0",
    "mlp_type": "default",
    "model_type": "starcoder2",
    "norm_type": "layer_norm"
}