{
    "task_type": "CAUSAL_LM",
    "peft_type": "PROMPT_TUNING",
    "auto_mapping": null,
    "peft_version": "0.18.1",
    "base_model_name_or_path": "meta-llama/CodeLlama-7b-hf",
    "revision": null,
    "inference_mode": true,
    "num_virtual_tokens": 20,
    "token_dim": 4096,
    "num_transformer_submodules": 1,
    "num_attention_heads": 32,
    "num_layers": 32,
    "modules_to_save": null,
    "prompt_tuning_init": "RANDOM",
    "prompt_tuning_init_text": null,
    "tokenizer_name_or_path": "meta-llama/CodeLlama-7b-hf",
    "tokenizer_kwargs": null
}