{
    "transformers_version": "5.5.3",
    "architectures": [
        "LlamaForCausalLM"
    ],
    "dtype": "bfloat16",
    "vocab_size": 32016,
    "hidden_size": 4096,
    "intermediate_size": 11008,
    "num_hidden_layers": 32,
    "num_attention_heads": 32,
    "num_key_value_heads": 32,
    "hidden_act": "silu",
    "max_position_embeddings": 16384,
    "initializer_range": 0.02,
    "rms_norm_eps": 1e-05,
    "use_cache": true,
    "pad_token_id": null,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "pretraining_tp": 1,
    "tie_word_embeddings": false,
    "rope_parameters": {
        "rope_theta": 1000000,
        "rope_type": "default"
    },
    "attention_bias": false,
    "attention_dropout": 0.0,
    "mlp_bias": false,
    "head_dim": 128,
    "model_type": "llama"
}